Repository: ghtmtt/DataPlotly
Catalog: help/locale/*/LC_MESSAGES/processing_provider.po
Languages: it

source: DataPlotly as Processing provider
it: DataPlotly come provider di Processing

source: From version 1.4 DataPlotly has been added as Processing provider thank to the work of `Michaël Douchin of 3Liz <https://www.3liz.com/>`_.
it: Dalla versione 1.4, DataPlotly può essere usato come provider di Processing grazie al lavoro di `Michaël Douchin of 3Liz <https://www.3liz.com/>`_.

source: This opens the doors to infinite possibilities:
it: Questa funzione apre le porte ad infinite possibilità:

source: using all the Processing methods with DataPlotly
it: usare tutte le funzioni di Processing con DataPlotly

source: creating batch plots with one click
it: creare grafici in serie con un semplice click

source: adding DataPlotly in the Processing Graphical Modeler
it: aggiungere DataPlotly al modellatore grafico di Processing

source: Activating DataPlotly for Processing
it: Attivare DataPlotly per Processing

source: First thing to do is activating Processing and add DataPlotly as provider. If not added by default you can go in ``Settings -> Options`` and click on the last tab named Processing.
it: La prima cosa da fare è attivare Processing e aggiunger DataPlotly come provider. Se DataPlotly non è visibile in Processing bisogna attivarlo nella scheda Processing del menu ``Impostazioni -> Opzioni`.

source: Expand the Provider menu and activate the DataPlotly provider:
it: Espandere il menu dei provider e attivare DataPlotly:

source: And then you will see the DataPltoly provider in the Processing Toolbox:
it: Cosi si vedrà DataPlotly fra gli algoritmi di Processing:

source: Simple DataPlotly usage
it: uso semplice di DataPlotly

source: The ``Build a generic plot`` algorithm is a simplified version of DataPlotly plugin: this means you don't have all the customizations available, but still you can create awesome plots.
it: L'algoritmo ``Crea un grafico generico`` è una versione semplificata di DataPlotly: questo significa che non saranno disponibili tutte le personalizzazioni, ma si possono comunque creare grafici fantastici.

source: The interface is very simple and the plot creation process is very straightforward:
it: L'interfaccia è molto semplice e la creazione di un grafico è altrettanto facile:

source: choose the layer
it: scegli il vettore

source: choose the plot type
it: scegli il tipo di grafico

source: adjust the additional options (plot title, X axis, Y axis and color)
it: scegli le opzioni aggiuntive (titolo, asse X, asse Y e colore)

source: DataPlotly will create 2 results:
it: Si ottengono 2 risultati:

source: ``html`` file with the final plot
it: file ``html`` del grafico

source: ``json`` file with all the plot specifications
it: file ``json`` con tutte le specifiche del grafico

source: The plot can be opened in the ``Processing -> Result Viewer``:
it: Il grafico è caricato in ``Processing -> Visualizzatore risultati``:

source: And by simple double clicking on the menu entry, the plot will be opened in your default browser:
it: Con un semplice doppio click sulla voce del menu il grafico si aprirà nel browser predefinito:

source: If you want to save also the ``json`` file, you have to specify the path in the DataPlotly Processing Window.
it: Se vuoi salvare anche il file ``json`` devi specificare un percorso preciso nella finestra dell'algoritmo.
